{
  "contact": {
    "name": "Sri Manikesh Makam",
    "location": "San Francisco, CA",
    "email": "makamsrimanikesh@outlook.com",
    "phone": "+1 (551) 267-5388",
    "linkedin": "linkedin.com/in/your-profile",
    "github": "github.com/your-username",
    "other": "medium.com/@your-profile"
  },
  "summary": "Data Scientist with 3 years expertise in automation, ML pipelines and statistical modeling for scalable data science and analytical solutions.",
  "education": [
    {
      "institution": "University of San Francisco",
      "degree": "Master of Science in Data Science",
      "location": "San Francisco, CA",
      "dates": "Jul 2024 - Jun 2025"
    },
    {
      "institution": "Indian Institute of Technology (IIT), Kanpur",
      "degree": "Bachelor of Technology in Aerospace Engineering",
      "location": "Kanpur, India",
      "dates": "Jul 2018 - Jun 2022"
    }
  ],
  "skills": [
    {
      "category": "Languages",
      "items": ["Python", "SQL", "R", "Bash"]
    },
    {
      "category": "ML/DL Frameworks",
      "items": ["PyTorch", "TensorFlow", "Keras", "Scikit-learn", "Pandas", "Numpy", "Seaborn", "Librosa", "OpenAI", "Generative AI", "Prompt Engineering", "RAG", "NLP", "Time Series Analysis", "Regression Analysis"]
    },
    {
      "category": "MLOps & Cloud",
      "items": ["AWS", "GCP", "Docker", "Kubernetes", "Airflow", "MLflow", "Metaflow", "CI/CD", "FastAPI", "Flask", "Streamlit", "Terraform", "GKE", "Cloud Run", "ETL Pipeline Design", "Data Warehousing"]
    },
    {
      "category": "Data & Tools",
      "items": ["MongoDB", "Snowflake", "Spark", "Git", "Selenium", "Salesforce", "ServiceNow", "Tableau", "PowerBI", "LangFlow", "Advanced Excel", "VBA", "Statistical Modeling", "Data Visualization"]
    }
  ],
  "experience": [
    {
      "title": "Data Scientist Intern",
      "company": "DRINKS",
      "location": "San Francisco, CA",
      "dates": "Oct 2024 - Jun 2025",
      "description": [
        "Built an AI-based wine recommendation system using OpenAI LLM and Flask, implementing RAG for context-aware responses.",
        "Reduced runtime by 80% with Pinecone vector search and multi-index framework while processing 10,000 embeddings on AWS S3.",
        "Integrated a cross-encoder reranking model from Hugging Face to enhance semantic similarity and improve retrieval accuracy.",
        "Developed AWS Bedrock AI Agent with preprocessing, advanced prompt engineering, efficient orchestration, and knowledge bases.",
        "Deployed Lambda functions to extract output parameters, wrapped them in API calls for seamless e-commerce website integration.",
        "Presented work to the Co-founder and CTO as an intern and successfully deployed the product company-wide for user adoption."
      ]
    },
    {
      "title": "Principal Analyst",
      "company": "Anheuser-Busch InBev",
      "location": "Bangalore, India",
      "dates": "Aug 2022 - Jun 2024",
      "description": [
        "Led a team of 4 to automate Excel-heavy workflows using Pandas, achieving $500,000 in savings across financial reporting cycles.",
        "Designed and deployed 8 dynamic interactive Power BI dashboards to monitor KPIs, cutting manual workload and errors by 80%.",
        "Streamlined reporting by managing 10+ datasets and automating 5 reports via SQL and Salesforce across supply chain operations.",
        "Built Excel VBA Macros for repetitive financial workflows, improving speed and consistency while saving $1,000 in manual effort.",
        "Standardized 15 data ingestion processes and mapped 20 operational workflows, enhancing data quality and documentation rigor.",
        "Executed 5 structured A/B test cycles on a sales application, improving BDR platform stability and raising CSAT scores by 15%."
      ]
    },
    {
      "title": "Data Scientist Intern",
      "company": "Janta Ka Mood",
      "location": "Kanpur, India",
      "dates": "May 2021 - Jul 2021",
      "description": [
        "Processed 5.2M+ voter records using Microsoft SQL Server, optimizing data extraction for high-volume analysis and reporting.",
        "Designed an interactive RStudio dashboard to show voter demographics, boosting efficiency by 40% by enabling data-driven decisions."
      ]
    }
  ],
  "projects": [
    {
      "name": "Parlay-and-Pray: AI Fantasy Team Predictor",
      "description": [
        "Built full-stack ML app to help users predict fantasy cricket teams using historical match data, player stats, and LLM-based insights.",
        "Conducted detailed EDA and engineered predictive features to extract player trends and improve model inputs for point estimation.",
        "Trained GradientBoostingRegressor for prediction modelling and integrated Google Gemini LLM for user queries using Langchain.",
        "Deployed the system end-to-end on GCP with containerized components using Docker and Kubernetes, exposing a FastAPI backend for serving models and a Streamlit UI for interactive team building; enabled scalable, real-time predictions for fantasy cricket users."
      ]
    },
    {
      "name": "AI Photo Colorizer",
      "description": [
        "Engineered a text-conditional diffusion model (DDIM) in PyTorch, leveraging a U-Net architecture and CLIP embeddings for generative image colorization in the LAB color space, with embedded pattern recognition for semantic feature extraction.",
        "Fine-tuned transfer learning from ImageNet to a historical dataset, boosting SSIM by 23% and reducing color error by 18%."
      ]
    },
    {
      "name": "VibeCheck AI: Speech Emotion Recognition",
      "description": [
        "Engineered Log-Mel spectrogram features from audio dataset using Librosa for an end-to-end speech emotion recognition system.",
        "Developed and evaluated a PyTorch CNN model for multi-class emotion classification, achieving 72.83% overall test accuracy.",
        "Optimized model performance via Optuna for automated hyperparameter tuning and audiomentations for robust data augmentation."
      ]
    },
    {
      "name": "Annual Census Data Analysis",
      "description": [
        "Used PySpark to process 650 GB of US Census data, enabling distributed data analysis and extracting actionable insights at scale.",
        "Developed a robust ETL pipeline using Selenium for data extraction, SQL for data transformation, Python for data visualization, Airflow DAGs for orchestration, and GCS with Google Cloud Composer for scalable storage and scheduling."
      ]
    },
    {
      "name": "Longitudinal Growth Prediction",
      "description": [
        "Performed EDA for adolescent growth prediction: feature engineering, outlier clipping, handling missingness, and correlation plots.",
        "Developed multi-model pipeline using Preece-Baines model, predicting with optimized parameter initialization and reduced error.",
        "Built CatBoost regression models for each target age using RandomizedSearchCV, reducing error via tuning and cross-validation."
      ]
    },
    {
      "name": "Medical Assistance Tool (IIT)",
      "description": [
        "Developed a continuous bag of words, NLP framework to predict department based on symptoms, achieving an accuracy of 81%.",
        "Defined Embedding, Lambda and Dense layers of Sequential NN model to predict one hot encoding of the desired target word.",
        "Performed PCA to reduce dimensions of word embedding vectors, and analyzed relation between them on a scatter plot."
      ]
    }
  ],
  "certifications": [
    {
      "name": "AWS Certified AI Practitioner",
      "issuer": "Amazon Web Services",
      "date": "Oct 2024",
      "description": [
        "Expertise in AWS AI and ML - Skilled in Amazon SageMaker, Bedrock, and AWS AI Services for model training and development.",
        "Generative AI and Prompt Engineering - Experience with Amazon Bedrock, Amazon Q, and LLM applications and techniques.",
        "AI Security and Deployment - Knowledge of AWS IAM policies, security services, AI governance, and scalable cloud deployments."
      ]
    }
  ]
}
